# Before your start:
- Read the README.md file
- Comment as much as you can and use the resources (README.md file)
- Happy learning!

In [1]:
# import numpy and pandas
import numpy as np
import pandas as pd

# Challenge 1 - Exploring the Data

In this challenge, we will examine all salaries of employees of the City of Chicago. We will start by loading the dataset and examining its contents.

In [2]:
# Your code here:
salaries = pd.read_csv('/Users/arthurspriet/Desktop/Lab Week 5 /lab-hypothesis-testing-1/your-code/Current_Employee_Names__Salaries__and_Position_Titles.csv')

Examine the `salaries` dataset using the `head` function below.

In [3]:
# Your code here:

salaries.head(10)

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,101442.0,NaN
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,94122.0,NaN
2,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,F,Salary,NaN,101592.0,NaN
3,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,F,Salary,NaN,110064.0,NaN
4,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,Hourly,20.0,NaN,19.86
5,"ABBASI, CHRISTOPHER",STAFF ASST TO THE ALDERMAN,CITY COUNCIL,F,Salary,NaN,50436.0,NaN
6,"ABBATACOLA, ROBERT J",ELECTRICAL MECHANIC,AVIATION,F,Hourly,40.0,NaN,46.10
7,"ABBATE, JOSEPH L",POOL MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,35.60
8,"ABBATEMARCO, JAMES J",FIRE ENGINEER-EMT,FIRE,F,Salary,NaN,103350.0,NaN
9,"ABBATE, TERRY M",POLICE OFFICER,POLICE,F,Salary,NaN,93354.0,NaN

We see from looking at the `head` function that there is quite a bit of missing data. Let's examine how much missing data is in each column. Produce this output in the cell below

In [4]:
salaries.isna().sum()

Name                     0
Job Titles               0
Department               0
Full or Part-Time        0
Salary or Hourly         0
Typical Hours        25161
Annual Salary         8022
Hourly Rate          25161
dtype: int64

Let's also look at the count of hourly vs. salaried employees. Write the code in the cell below

In [5]:
# Your code here:
x = salaries['Hourly Rate'].isna().sum()
y = salaries['Annual Salary'].isna().sum()
print('Hourly Rate',x,'Annual Salary',y)

salaries

Hourly Rate 25161 Annual Salary 8022

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,101442.0,NaN
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,94122.0,NaN
2,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,F,Salary,NaN,101592.0,NaN
3,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,F,Salary,NaN,110064.0,NaN
4,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,Hourly,20.0,NaN,19.86
...,...,...,...,...,...,...,...,...
33178,"ZYLINSKA, KATARZYNA",POLICE OFFICER,POLICE,F,Salary,NaN,72510.0,NaN
33179,"ZYMANTAS, LAURA C",POLICE OFFICER,POLICE,F,Salary,NaN,48078.0,NaN
33180,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,F,Salary,NaN,90024.0,NaN
33181,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,F,Salary,NaN,93354.0,NaN
33182,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,F,Salary,NaN,115932.0,NaN

What this information indicates is that the table contains information about two types of employees - salaried and hourly. Some columns apply only to one type of employee while other columns only apply to another kind. This is why there are so many missing values. Therefore, we will not do anything to handle the missing values.

There are different departments in the city. List all departments and the count of employees in each department.

In [6]:
# Your code here:

uni = pd.unique(salaries['Department'])
n = salaries.groupby('Department').count()
n = n.reset_index()

n['total'] = n['Name']

n

,Department,Name,Job Titles,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,total
0,ADMIN HEARNG,39,39,39,39,0,39,0,39
1,ANIMAL CONTRL,81,81,81,81,19,62,19,81
2,AVIATION,1629,1629,1629,1629,1082,547,1082,1629
3,BOARD OF ELECTION,107,107,107,107,0,107,0,107
4,BOARD OF ETHICS,8,8,8,8,0,8,0,8
5,BUDGET & MGMT,46,46,46,46,2,44,2,46
6,BUILDINGS,269,269,269,269,0,269,0,269
7,BUSINESS AFFAIRS,171,171,171,171,7,164,7,171
8,CITY CLERK,84,84,84,84,0,84,0,84
9,CITY COUNCIL,411,411,411,411,64,347,64,411
10,COMMUNITY DEVELOPMENT,207,207,207,207,4,203,4,207
11,COPA,116,116,116,116,0,116,0,116
12,CULTURAL AFFAIRS,65,65,65,65,7,58,7,65
13,DISABILITIES,28,28,28,28,0,28,0,28
14,DoIT,99,99,99,99,0,99,0,99
15,FAMILY & SUPPORT,615,615,615,615,287,328,287,615
16,FINANCE,560,560,560,560,44,516,44,560
17,FIRE,4641,4641,4641,4641,2,4639,2,4641
18,GENERAL SERVICES,980,980,980,980,765,215,765,980
19,HEALTH,488,488,488,488,3,485,3,488
20,HUMAN RELATIONS,16,16,16,16,0,16,0,16
21,HUMAN RESOURCES,79,79,79,79,4,75,4,79
22,INSPECTOR GEN,87,87,87,87,0,87,0,87
23,LAW,407,407,407,407,40,367,40,407
24,LICENSE APPL COMM,1,1,1,1,0,1,0,1
25,MAYOR'S OFFICE,85,85,85,85,8,77,8,85
26,OEMC,2102,2102,2102,2102,1273,829,1273,2102
27,POLICE,13414,13414,13414,13414,10,13404,10,13414
28,POLICE BOARD,2,2,2,2,0,2,0,2
29,PROCUREMENT,92,92,92,92,2,90,2,92
30,PUBLIC LIBRARY,1015,1015,1015,1015,299,716,299,1015
31,STREETS & SAN,2198,2198,2198,2198,1862,336,1862,2198
32,TRANSPORTN,1140,1140,1140,1140,725,415,725,1140
33,TREASURER,22,22,22,22,0,22,0,22
34,WATER MGMNT,1879,1879,1879,1879,1513,366,1513,1879

In [8]:
for dptmnt in [salaries[salaries['Department']] :

SyntaxError: invalid syntax (86434513.py, line 1)

# Challenge 2 - Hypothesis Tests

In this section of the lab, we will test whether the hourly wage of all hourly workers is significantly different from $30/hr. Import the correct one sample test function from scipy and perform the hypothesis test for a 95% two sided confidence interval.

In [9]:
import scipy.stats as st
H = 'Hourly'
alpha = 0.05
hourly = salaries[salaries['Salary or Hourly']==H]
hourly_r = hourly['Hourly Rate']
sample = hourly_r.sample(50)
std = sample.std(ddof=1)
mean = sample.mean()
n = len(sample)
stats = (mean - 50)/(std/np.sqrt(n))
p_value = st.t.sf(abs(stats), 50-1)*2
print(stats,p_value)
p_value > alpha

-11.58974639589149 1.2026484380441348e-15

False

In [12]:
data.head()

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False

We are also curious about salaries in the police force. The chief of police in Chicago claimed in a press briefing that salaries this year are higher than last year's mean of $86000/year a year for all salaried employees. Test this one sided hypothesis using a 95% confidence interval.

Hint: A one tailed test has a p-value that is half of the two tailed p-value. If our hypothesis is greater than, then to reject, the test statistic must also be positive.

In [ ]:
# Your code here:

Using the `crosstab` function, find the department that has the most hourly workers.

In [ ]:
# Your code here:

The workers from the department with the most hourly workers have complained that their hourly wage is less than $35/hour. Using a one sample t-test, test this one-sided hypothesis at the 95% confidence level.

In [ ]:
# Your code here:

# Challenge 3: To practice - Constructing Confidence Intervals

While testing our hypothesis is a great way to gather empirical evidence for accepting or rejecting the hypothesis, another way to gather evidence is by creating a confidence interval. A confidence interval gives us information about the true mean of the population. So for a 95% confidence interval, we are 95% sure that the mean of the population is within the confidence interval. 
).

To read more about confidence intervals, click [here](https://en.wikipedia.org/wiki/Confidence_interval).


In the cell below, we will construct a 95% confidence interval for the mean hourly wage of all hourly workers. 

The confidence interval is computed in SciPy using the `t.interval` function. You can read more about this function [here](https://docs.scipy.org/doc/scipy-0.14.0/reference/generated/scipy.stats.t.html).

To compute the confidence interval of the hourly wage, use the 0.95 for the confidence level, number of rows - 1 for degrees of freedom, the mean of the sample for the location parameter and the standard error for the scale. The standard error can be computed using [this](https://docs.scipy.org/doc/scipy/reference/generated/scipy.stats.sem.html) function in SciPy.

In [ ]:
# Your code here:

Now construct the 95% confidence interval for all salaried employeed in the police in the cell below.

In [ ]:
# Your code here:

# Bonus Challenge - Hypothesis Tests of Proportions

Another type of one sample test is a hypothesis test of proportions. In this test, we examine whether the proportion of a group in our sample is significantly different than a fraction. 

You can read more about one sample proportion tests [here](http://sphweb.bumc.bu.edu/otlt/MPH-Modules/BS/SAS/SAS6-CategoricalData/SAS6-CategoricalData2.html).

In the cell below, use the `proportions_ztest` function from `statsmodels` to perform a hypothesis test that will determine whether the number of hourly workers in the City of Chicago is significantly different from 25% at the 95% confidence level.

In [ ]:
# Your code here: